blueskycoco/d5/SRC/DRIVERS/FMD/FMD/lpc32xx_fmd.cpp
    nandCSLock(FALSE);

	return goodid;
}

//------------------------------------------------------------------------------
//
// nandGetPageIndex
//
// Get an address from a sector number
//
void nandGetPageIndex(ULONG SectorAddr,
					  ULONG offset,
					  unsigned char *addrbytes) {
    ULONG block, page, nandaddr;

	// Limit offset
    if (offset >= 256)
	{
        offset = 0;
    }

    // Determine block and page offsets from passed sector address
    block = SectorAddr / nandDrvDat.dwSectorsPerBlock;
    page = SectorAddr - (block * nandDrvDat.dwSectorsPerBlock);

	// Block  Page  Index
	// 31..13 12..8 7..0
	nandaddr = offset + ((page & 0x1F) << 8);
	nandaddr = nandaddr | ((block & 0xFFF) << 13);

    // Save block and page address
	addrbytes[0] = (UNS_8) ((nandaddr >> 0) & 0xFF);
	addrbytes[1] = (UNS_8) ((nandaddr >> 8) & 0xFF);
	addrbytes[2] = (UNS_8) ((nandaddr >> 16) & 0xFF);
	if (nandDrvDat.addressCycles == 4) 
	{
		addrbytes[3] = (UNS_8) ((nandaddr >> 24) & 0xFF);
	}
}

//------------------------------------------------------------------------------
//
// FMD_Init
//
// Initialize FLASH interface and data
//
extern "C"
PVOID FMD_Init(LPCTSTR lpActiveReg,
			   PPCI_REG_INFO pRegIn,
               PPCI_REG_INFO pRegOut)
{
    PHYSICAL_ADDRESS pa;
	DWORD irq;
	UINT32 clk, bytesret;
	PVOID ret = NULL;
    BOOL validconfig = FALSE;
    
    /* Unused parameters */
    (void) pRegIn;
    (void) lpActiveReg;

	// Defaults
	nandDrvDat.pCLKPWRRegs = NULL;
	nandDrvDat.pSLCRegs = NULL;
	nandDrvDat.pGPIORegs = NULL;
	nandDrvDat.dwSysIntr = SYSINTR_UNDEFINED;
	nandDrvDat.dwEvent = NULL;
#ifdef FMDACCESSLOCKS
	nandDrvDat.Lockmutex = NULL;
#endif
	// MAP CLKPWR and SLC registers
	pa.QuadPart = CLK_PM_BASE;
	nandDrvDat.pCLKPWRRegs = (CLKPWR_REGS_T *) MmMapIoSpace(pa,
		sizeof (CLKPWR_REGS_T), FALSE);
	pa.QuadPart = SLC_BASE;
	nandDrvDat.pSLCRegs = (SLCNAND_REGS_T *) MmMapIoSpace(pa,
		sizeof (SLCNAND_REGS_T), FALSE);
	pa.QuadPart = GPIO_BASE;
	nandDrvDat.pGPIORegs = (GPIO_REGS_T *) MmMapIoSpace(pa,
		sizeof (GPIO_REGS_T), FALSE);
	if ((nandDrvDat.pCLKPWRRegs == NULL) || (nandDrvDat.pSLCRegs == NULL) ||
		(nandDrvDat.pGPIORegs == NULL))
	{
        RETAILMSG(1, 
			(TEXT("FMD: Failed to map registers\r\n")));
		goto cleanup;
	}

	// Setup SLC mode and enable SLC clock
	nandDrvDat.pCLKPWRRegs->clkpwr_nand_clk_ctrl = (CLKPWR_NANDCLK_SEL_SLC |
		CLKPWR_NANDCLK_SLCCLK_EN);

	// Reset SLC controller and setup for 8-bit mode, disable and clear interrupts
	nandDrvDat.pSLCRegs->slc_ctrl = SLCCTRL_SW_RESET;
	Sleep(1);
	nandDrvDat.pSLCRegs->slc_cfg = 0;
	nandDrvDat.pSLCRegs->slc_ien = SLCSTAT_INT_RDY_EN;
	nandDrvDat.pSLCRegs->slc_icr = (SLCSTAT_INT_TC |
		SLCSTAT_INT_RDY_EN);

	// Get current system clock speed for the SLC block
	if (KernelIoControl(IOCTL_LPC32XX_GETHCLK, NULL, 0, &clk,
		sizeof (clk), (LPDWORD) &bytesret) == FALSE)
	{
		// Cannot get clock, use default
        RETAILMSG(1, 
            (TEXT("FMD: Error getting SLC base clock rate.\r\n")));
		clk = 104000000;
	}

	// Setup SLC timing based on current clock
    nandDrvDat.pSLCRegs->slc_tac = (
		SLCTAC_WDR(PHY_NAND_WDR) |
		SLCTAC_WWIDTH(clk / PHY_NAND_WWIDTH) |
		SLCTAC_WHOLD(clk / PHY_NAND_WHOLD) |
		SLCTAC_WSETUP(clk / PHY_NAND_WSETUP) |
		SLCTAC_RDR(PHY_NAND_RDR) |
		SLCTAC_RWIDTH(clk / PHY_NAND_RWIDTH) |
		SLCTAC_RHOLD(clk / PHY_NAND_RHOLD) |
		SLCTAC_RSETUP(clk / PHY_NAND_RSETUP));

	// Get device geometry
	if (nandGetGeom() == FALSE)
	{
		// Unsupported type
        RETAILMSG(1, (TEXT("FMD: Unsupported device type.\r\n")));
		goto cleanup;
	}

	// Map sysIntr value to the NAND interrupt
	irq = OAL_INTR_IRQ_NAND;
    if (!KernelIoControl(IOCTL_HAL_REQUEST_SYSINTR, &irq,
		sizeof(irq), &nandDrvDat.dwSysIntr, sizeof(nandDrvDat.dwSysIntr), NULL))
    {
		RETAILMSG(1,
			(TEXT("FMD: Error obtaining SYSINTR value!\r\n")));
        nandDrvDat.dwSysIntr = SYSINTR_UNDEFINED;
        goto cleanup;
    }

	// Create NAND interrupt event
	nandDrvDat.dwEvent = CreateEvent(NULL, FALSE, FALSE, NULL);
	if (nandDrvDat.dwEvent == NULL)
	{
		RETAILMSG(1, 
			(TEXT("FMD: Failed to create NAND handler event.\r\n")));
		nandDrvDat.dwEvent = NULL;
        goto cleanup;
	}

	// Bind interrupt to events
	if (InterruptInitialize(nandDrvDat.dwSysIntr, nandDrvDat.dwEvent, NULL,
		0) == FALSE)
	{
		// Cannot initialize interrupt
		RETAILMSG(1, 
			(TEXT("FMD: Cannot initialize NAND interrupt\r\n")));
        goto cleanup;
	}

#ifdef FMDACCESSLOCKS
	// Create lock
	nandDrvDat.Lockmutex = CreateMutex(NULL, FALSE, NULL);
    if (nandDrvDat.Lockmutex == NULL) {
		RETAILMSG(1, 
			(TEXT("FMD: Cannot create mutex lock\r\n")));
        goto cleanup;
    }
#endif

	// Initialize ECC
    eccInitTables();

	// Reset device
	nandWriteCommand(LPCNAND_CMD_RESET);
	nandWaitReady(10);

    ret = &nandDrvDat;
    
cleanup:
	if (ret == NULL)
	{
	    FMD_Deinit(&nandDrvDat);
	}

	return ret;
}

//------------------------------------------------------------------------------
//
// FMD_Deinit
//
// De-initialize NAND interface
//
extern "C"
BOOL FMD_Deinit(PVOID hFMD)
{
	// Close event handle
	if (nandDrvDat.dwEvent != NULL)
	{
		CloseHandle(nandDrvDat.dwEvent);
		nandDrvDat.dwEvent = NULL;
	}

	// Return sysIntr value
	if (nandDrvDat.dwSysIntr != SYSINTR_UNDEFINED)
	{
		InterruptDisable(nandDrvDat.dwSysIntr);
		KernelIoControl(IOCTL_HAL_RELEASE_SYSINTR, &nandDrvDat.dwSysIntr,
            sizeof(nandDrvDat.dwSysIntr), NULL, 0, NULL);
		nandDrvDat.dwSysIntr = SYSINTR_UNDEFINED;
	}

	// Diable SLC clock and unmap registers
	if (nandDrvDat.pCLKPWRRegs != NULL)
	{
		nandDrvDat.pCLKPWRRegs->clkpwr_nand_clk_ctrl &= ~CLKPWR_NANDCLK_SLCCLK_EN;
        MmUnmapIoSpace((PVOID) nandDrvDat.pCLKPWRRegs, sizeof (CLKPWR_REGS_T));
		nandDrvDat.pCLKPWRRegs = NULL;
	}

	if (nandDrvDat.pSLCRegs != NULL)
	{
        MmUnmapIoSpace((PVOID) nandDrvDat.pSLCRegs, sizeof (SLCNAND_REGS_T));
		nandDrvDat.pSLCRegs = NULL;
	}

