blueskycoco/d5/SRC/DRIVERS/FMD/FMD/lpc32xx_fmd.cpp
            // Check and correct data
            if (eccCheckAndCorrect(eccin, ecccomp,
                pSectorBuff) == ECC_NOTCORRECTABLE)
			{
                // Uncorrectable error, report it to FAL
                nandCSLock(FALSE);
                RETAILMSG(1, (TEXT("FMD: ECC failure\r\n")));
				nandMutexUnlock();
                return FALSE;
            }
                
            pSectorBuff = pSectorBuff + 512;
        }
        else if (pSectorInfoBuff != NULL)
        {
            nandGetPageIndex(SectorAddr, 0, addrbytes);
            /* Read sectorinfo structure from FLASH */
            nandWriteCommand(LPCNAND_CMD_PAGE_READC);
            nandWriteAddress(addrbytes, nandDrvDat.addressCycles);
            nandWaitReady(MAXEREADTIMEINMS);
            nandReadData(pSectorInfoBuff, sizeof(SectorInfo));
            pSectorInfoBuff++;
		}

        ++SectorAddr;
        dwNumSectors--;

	    /* Unlock access and chip select */
		nandCSLock(FALSE);
		nandMutexUnlock();
	}

    return TRUE;
}

//------------------------------------------------------------------------------
//
// FMD_WriteSector
//
// Write a number of sectors
//
extern "C"
BOOL FMD_WriteSector(SECTOR_ADDR startSectorAddr,
					 LPBYTE pSectorBuff,
                     PSectorInfo pSectorInfoBuff,
					 DWORD dwNumSectors)
{
	unsigned char addrbytes[5];
    BYTE Status;
    unsigned short ecccomp[2];
    ULONG SectorAddr;

#if BYPASSBLOCKS>0
	startSectorAddr += (BYPASSBLOCKS * nandDrvDat.dwSectorsPerBlock);
#endif
	SectorAddr = startSectorAddr;

	if ((pSectorBuff == NULL) && (pSectorInfoBuff == NULL)) {
        return FALSE;
    }

	/* Lock access and chip select */
	nandMutexLock();
    nandCSLock(TRUE);
    
    while (dwNumSectors > 0) {
        if (pSectorBuff != NULL) {
            /* Setup write */
            nandGetPageIndex(SectorAddr, 0, addrbytes);
            nandWriteCommand(LPCNAND_CMD_PAGE_READA);
            nandWriteCommand(LPCNAND_CMD_PAGE_WRITE1);
            nandWriteAddress(addrbytes, nandDrvDat.addressCycles);
            
            /* Copy buffer to NAND */
            nandWriteData(pSectorBuff, 512);
                
            /* Copy buffer to NAND and generate ECC */
            eccGenerate512(ecccomp, pSectorBuff);
            pSectorBuff = pSectorBuff + 512;
            
            /* Write sectorinfo structure */
            if (pSectorInfoBuff != NULL) {
                /* Seek to sectorinfo offset */
                nandWriteData(pSectorInfoBuff, sizeof(SectorInfo));
                pSectorInfoBuff++;
            }
			else
			{
				// For the ECC to be written in the correct location,
				// the page needs to be written now and a new write
				// session needs to be opened at the correct FLASH
				// page data index
	            nandWriteCommand(LPCNAND_CMD_PAGE_WRITE2);
		        nandWaitReady(MAXEWRITETIMEINMS);

				nandGetPageIndex(SectorAddr, 8, addrbytes);
		        nandWriteCommand(LPCNAND_CMD_PAGE_READC);
			    nandWriteCommand(LPCNAND_CMD_PAGE_WRITE1);
	            nandWriteAddress(addrbytes, nandDrvDat.addressCycles);
			}
            
            /* Write ECC data */
            nandWriteData(&ecccomp, sizeof(ecccomp));
            nandWriteCommand(LPCNAND_CMD_PAGE_WRITE2);
            nandWaitReady(MAXEWRITETIMEINMS);
        }
        else if (pSectorInfoBuff != NULL) {
            /* Update jsut sectorinfo data */
            nandGetPageIndex(SectorAddr, 0, addrbytes);
            nandWriteCommand(LPCNAND_CMD_PAGE_READC);
            nandWriteCommand(LPCNAND_CMD_PAGE_WRITE1);
            nandWriteAddress(addrbytes, nandDrvDat.addressCycles);
            nandWriteData(pSectorInfoBuff, sizeof(SectorInfo));
            pSectorInfoBuff++;
            nandWriteCommand(LPCNAND_CMD_PAGE_WRITE2);
            nandWaitReady(MAXEWRITETIMEINMS);
        }
        
        nandWriteCommand(LPCNAND_CMD_STATUS);
        nandReadData(&Status, 1);
        if ((Status & 0x1) != 0) {
            nandCSLock(FALSE);
			RETAILMSG(1,
				(TEXT("FMD: Write status failure, status = 0x%02x\r\n"), Status));
			nandMutexUnlock();
            return FALSE;
        }
        
        ++SectorAddr;
        dwNumSectors--;
    }
    
    /* Unlock access and chip select */
    nandCSLock(FALSE);
	nandMutexUnlock();

    return TRUE;
}
